# RebarPropagation Methods

---
The RebarPropagation type exposes the following members.
| Name| Description
---|---|---
| AlignByFace|
| AlignByHost|
Top
#### Reference
RebarPropagation Class
Autodesk.Revit.DB.Structure Namespace